describe("do_sort", function() {

    before(function() {
    lst = lists();
    lst.add_slist('ментор_1', ['студент_1', 'студент_2', 'студент_3']);
    lst.add_slist('ментор_2', ['студент_1', 'студент_3', 'студент_2']);
    lst.add_slist('ментор_3', ['студент_3', 'студент_1', 'студент_2']);

    lst.add_mlist('студент_1', ['ментор_1', 'ментор_3', 'ментор_2']);
    lst.add_mlist('студент_2', ['ментор_2', 'ментор_3', 'ментор_1']);
    lst.add_mlist('студент_3', ['ментор_2', 'ментор_1', 'ментор_3']);

    srt = sorts();
   });


    it("Добавляет приоритезированный список студентов - ментору", function() {
        assert.equal(srt.do_sort(lst), 'ментор_1');
    });




});
